feat: add index in README.md and use Mermaid to represent architecture schemas
